<?php
/**
 * Created by PhpStorm.
 * User: Avenax
 * Date: 25.08.2019
 * Time: 12:58
 */

const COUNT_TRAINING = 3; // количество при улучшении в тренировке


/**
 * стоимость тренировок
 * @param $level
 * @return object
 */
function priceTraining($level) {

    $level++;
    $arr = [
        1 => ['s' => 50],
        2 => ['s' => 100],
        3 => ['s' => 150],
        4 => ['s' => 200],
        5 => ['g' => 5],
        6 => ['s' => 400],
        7 => ['s' => 600],
        8 => ['s' => 800],
        9 => ['s' => 1000],
        10 => ['g' => 20],
        11 => ['s' => 1500],
        12 => ['s' => 2500],
        13 => ['s' => 3500],
        14 => ['s' => 5000],
        15 => ['g' => 50],
        16 => ['s' => 7000],
        17 => ['s' => 9600],
        18 => ['s' => 12000],
        19 => ['s' => 15000],
        20 => ['g' => 100],
        21 => ['s' => 18000],
        22 => ['s' => 21000],
        23 => ['s' => 24000],
        24 => ['s' => 27000],
        25 => ['g' => 200],
        26 => ['s' => 30000],
        27 => ['s' => 34000],
        28 => ['s' => 38000],
        29 => ['s' => 42000],
        30 => ['g' => 400],
        31 => ['s' => 46000],
        32 => ['s' => 50000],
        33 => ['s' => 54000],
        34 => ['s' => 60000],
        35 => ['g' => 800],
        36 => ['s' => 75000],
        37 => ['s' => 80000],
        38 => ['s' => 85000],
        39 => ['s' => 90000],
        40 => ['g' => 1500],
        41 => ['s' => 90000],
        42 => ['s' => 105000],
        43 => ['s' => 120000],
        44 => ['s' => 135000],
        46 => ['s' => 150000],
        47 => ['s' => 200000],
        48 => ['s' => 250000],
        49 => ['s' => 300000],
        51 => ['s' => 450000],
        52 => ['s' => 500000],
        53 => ['s' => 550000],
        54 => ['s' => 600000],
        56 => ['s' => 700000],
        57 => ['s' => 800000],
        58 => ['s' => 900000],
        59 => ['s' => 1000000],
        61 => ['s' => 1250000],
        62 => ['s' => 1500000],
        63 => ['s' => 1750000],
        64 => ['s' => 2000000],
        66 => ['s' => 2500000],
        67 => ['s' => 3000000],
        68 => ['s' => 3500000],
        69 => ['s' => 4000000],
        71 => ['s' => 5000000],
        72 => ['s' => 6000000],
        73 => ['s' => 7000000],
        74 => ['s' => 8000000],
        95 => ['g' => 4500],
        195 => ['g' => 8000],
        200 => ['g' => 10000],
    ];
    $price101 = 111000000;
    $price76 = 10000000;

    for ($i = 1; $i <= 200; $i++) {

        if ($i >= 101) {
            if ($i % 5 != 0) {
                $arr[$i]['s'] = $price101;
                $price101 += 1000000;
            } else {
                if (in_array($i, [165, 170, 175, 180, 185, 190])) {
                    $arr[$i]['g'] = 6000;
                } else if (in_array($i, [160, 155])) {
                    $arr[$i]['g'] = 5500;
                } else if (in_array($i, [150, 145, 140, 135])) {
                    $arr[$i]['g'] = 5000;
                } else if (in_array($i, [130, 125, 120, 115])) {
                    $arr[$i]['g'] = 4500;
                } else if (in_array($i, [110, 105, 100])) {
                    $arr[$i]['g'] = 4500;
                }
            }
        } else {
            if ($i % 5 != 0) {
                if ($i >= 76 && $i <= 99) {
                    $arr[$i]['s'] = $price76;
                    $price76 += 5000000;
                }
            } else {
                if (in_array($i, [90, 85, 80, 75])) {
                    $arr[$i]['g'] = 3000;
                } else if (in_array($i, [45, 50, 55, 60, 65, 70])) {
                    $arr[$i]['g'] = 2500;
                }
            }
        }
    }
    $arr = (object) $arr;
    return (object) $arr->$level;
}


function checkSets() {
    if (empty($_GET['sets']) || !in_array($_GET['sets'], range(1, 6))) {
        header('Location: /armors');
        exit();
    }
    return true;
}

function checkLevelItem($uLevel, $iLevel) {
    if ($uLevel < $iLevel) {
        header('Location: /armors');
        exit();
    }
}

function confirm($urlYes, $urlNo, $yesText = 'Да, согласен.', $noText = 'Нет, отказываюсь!') {
    $str = '<div style="padding-top: 3px;"></div><a href="' . $urlYes . '" class="button_green_a">' . $yesText . '</a><div style="padding-top: 3px;"></div>';
    $str .= '<a href="' . $urlNo . '" class="button_red_a">' . $noText . '</a><div style="padding-top: 3px;"></div>';
    return $str;
}